data/perf/stageB-d3bf9f8c39fe/mysql/tsan-ea/run3/oltp_read_write.txt
Sysbench script: /usr/share/sysbench/oltp_read_write.lua
sysbench /usr/share/sysbench/oltp_read_write.lua --mysql-user=root --mysql-socket=/tmp/mysql.sock  --threads=18 --time=180 --rand-type=special run | awk '/Latency \(ms\):/ { exit; } 1'
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 18
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            84938
        write:                           24262
        other:                           12132
        total:                           121332
    transactions:                        6065   (33.64 per sec.)
    queries:                             121332 (673.05 per sec.)
    ignored errors:                      2      (0.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          180.2705s
    total number of events:              6065

MySQL build: ..